{
  "_comment": "Basic Fantasy RPG Classes Configuration",
  "_documentation": {
    "format": "Each class defines its requirements, abilities, and progression",
    "requirements": "Minimum ability scores required to play this class",
    "prime_attributes": "Attributes that affect experience point bonuses",
    "hit_die": "Die type used for hit point calculation",
    "base_attack_bonus": "How attack bonus progresses with level",
    "abilities": "Special class abilities and features"
  },
  "classes": [
    {
      "id": "fighter",
      "name": "Fighter",
      "description": "Fighters include soldiers, guardsmen, barbarian warriors, and anyone else for whom fighting is a way of life. They train in combat, and they generally approach problems head-on, weapon in hand.",
      "detailed_description": "Not surprisingly, Fighters are the best at fighting of all the classes. They are also the hardiest, able to take more punishment than any other class. Although they are not skilled in the ways of magic, Fighters can nonetheless use many magic items, including but not limited to magical weapons and armor.",
      "requirements": {
        "strength": 9
      },
      "prime_attributes": ["strength"],
      "hit_die": "d8",
      "armor_allowed": "Any armor",
      "weapons_allowed": "Any weapon",
      "special_abilities": [
        {
          "name": "Combat Mastery",
          "description": "Fighters are the best at fighting of all the classes, with the best attack bonus progression"
        },
        {
          "name": "Hardiness",
          "description": "Fighters are the hardiest class, able to take more punishment than any other class"
        },
        {
          "name": "Magic Item Use",
          "description": "Although not skilled in magic, Fighters can use many magic items, including magical weapons and armor"
        }
      ],
      "restrictions": [],
      "spell_progression": null,
      "experience_bonus_requirements": {
        "strength": 13
      },
      "role": "Warrior",
      "starting_equipment": "Any armor and weapons"
    },
    {
      "id": "magic_user",
      "name": "Magic-User",
      "description": "Magic-Users are those who seek and use knowledge of the arcane. They do magic not as the Cleric does, by faith in a greater power, but rather through insight and understanding.",
      "detailed_description": "Magic-Users are the worst of all the classes at fighting; hours spent studying massive tomes of magic do not lead a character to become strong or adept with weapons. They are the least hardy, equal to Thieves at lower levels but quickly falling behind.",
      "requirements": {
        "intelligence": 9
      },
      "prime_attributes": ["intelligence"],
      "hit_die": "d4",
      "armor_allowed": "None",
      "weapons_allowed": "Dagger and walking staff (or cudgel) only",
      "special_abilities": [
        {
          "name": "Arcane Spellcasting",
          "description": "Magic-Users can cast arcane spells through study and understanding"
        },
        {
          "name": "Starting Spells",
          "description": "A first level Magic-User begins play knowing read magic and one other spell of first level, written in a spellbook provided by their master"
        },
        {
          "name": "Spellbook",
          "description": "Magic-Users must study their spells from a spellbook to memorize them each day"
        }
      ],
      "restrictions": [
        "Magic-Users may not wear armor of any sort nor use a shield as such things interfere with spellcasting",
        "The only weapons they become proficient with are the dagger and the walking staff (or cudgel)"
      ],
      "spell_progression": {
        "note": "Gains spell slots based on level, must memorize spells from spellbook",
        "spell_type": "Arcane",
        "preparation": "Must study spells from spellbook each day to memorize them"
      },
      "experience_bonus_requirements": {
        "intelligence": 13
      },
      "role": "Arcane Spellcaster",
      "starting_equipment": "Robes, walking staff, dagger, spellbook with read magic and one 1st level spell"
    },
    {
      "id": "cleric",
      "name": "Cleric",
      "description": "Clerics are those who have devoted themselves to the service of a deity, pantheon or other belief system. Most Clerics spend their time in mundane forms of service such as preaching and ministering in a temple; but there are those who are called to go abroad from the temple and serve their deity in a more direct way, smiting undead monsters and aiding in the battle against evil and chaos.",
      "detailed_description": "Clerics fight about as well as Thieves, but not as well as Fighters. They are hardier than Thieves, at least at lower levels, as they are accustomed to physical labor that the Thief would deftly avoid. Clerics can cast spells of divine nature starting at 2nd level, and they have the power to Turn the Undead, that is, to drive away undead monsters by means of faith alone.",
      "requirements": {
        "wisdom": 9
      },
      "prime_attributes": ["wisdom"],
      "hit_die": "d6",
      "armor_allowed": "Any armor",
      "weapons_allowed": "Blunt weapons only (specifically including warhammer, mace, maul, club, quarterstaff, and sling)",
      "special_abilities": [
        {
          "name": "Divine Spellcasting",
          "description": "Clerics can cast spells of divine nature starting at 2nd level"
        },
        {
          "name": "Turn Undead",
          "description": "Clerics have the power to Turn the Undead, that is, to drive away undead monsters by means of faith alone"
        },
        {
          "name": "Divine Service",
          "description": "Clerics serve their deity in a direct way, smiting undead monsters and aiding in the battle against evil and chaos"
        }
      ],
      "restrictions": [
        "Clerics may only use blunt weapons (specifically including warhammer, mace, maul, club, quarterstaff, and sling)"
      ],
      "spell_progression": {
        "note": "Gains spell slots starting at 2nd level, spells granted by deity",
        "spell_type": "Divine",
        "preparation": "Must pray for spells each day, spells granted by deity"
      },
      "experience_bonus_requirements": {
        "wisdom": 13
      },
      "role": "Divine Spellcaster/Healer",
      "starting_equipment": "Any armor, blunt weapons, holy symbol"
    },
    {
      "id": "thief",
      "name": "Thief",
      "description": "Thieves are those who take what they want or need by stealth, disarming traps and picking locks to get to the gold they crave; or \"borrowing\" money from pockets, beltpouches, etc. right under the nose of the \"mark\" without the victim ever knowing.",
      "detailed_description": "Thieves fight better than Magic-Users but not as well as Fighters. Avoidance of honest work leads Thieves to be less hardy than the other classes, though they do pull ahead of the Magic-Users at higher levels.",
      "requirements": {
        "dexterity": 9
      },
      "prime_attributes": ["dexterity"],
      "hit_die": "d4",
      "armor_allowed": "Leather armor only (no metal armor, no shields)",
      "weapons_allowed": "Any weapon",
      "special_abilities": [
        {
          "name": "Thief Abilities",
          "description": "Open Locks, Remove Traps, Pick Pockets, Move Silently, Climb Walls, Hide, Listen - all with percentage chances that improve with level"
        },
        {
          "name": "Sneak Attack",
          "description": "Thieves can perform a Sneak Attack any time they are behind an opponent in melee and it is likely the opponent doesn't know the Thief is there. The Sneak Attack is made with a +4 attack bonus and does double damage if it is successful"
        },
        {
          "name": "Stealth Expertise",
          "description": "Thieves excel at stealth, disarming traps, picking locks, and other skills that others consider disreputable"
        }
      ],
      "restrictions": [
        "Thieves may not wear metal armor as it interferes with stealthy activities, nor may they use shields of any sort. Leather armor is acceptable, however"
      ],
      "spell_progression": null,
      "experience_bonus_requirements": {
        "dexterity": 13
      },
      "role": "Scout/Stealth Specialist",
      "starting_equipment": "Leather armor, thieves' tools, various weapons"
    }
  ]
} 